com/com.org
*** lineas electricas
    + las compañias las han utilizado para comunicacion de baja velocidad
    + uso en el hogar para controlar dispositivos
    + dificil porque el cableado de las casas no esta hecho para enviar señales a alta frecuencia
*** fibra optica
    + lan, internet y ftth
    + un pulso de luz indica 1, la ausencia 0
    + cuando la luz pasa de un medio a otro (silice a aire) se refracta. el grado depende de los indices de refraccion de los medios. y para cualquier angulo mayor a un angulo critico la luz rebota completamente en el silice
    + fibra multimodal: varios rayos de luz en una fibra
    + fibra monomodo: un solo rayo de luz por fibra que es mucho mas angosta
    + tres bandas: 0.85 1.3 y 1.55 micras. anchos de banda de 25000 a 30000 ghz. la primera tiene mas atenuacion
    + fuentes: led y laser
** transmision inalambrica
*** espectro electromagnetico
    + los electrones se mueven y crean ondas electromagneticas
    + las ondas viajan siempre a la velocidad de la luz
    + $\lambda f=c$
    + espectro directo con salto de frecuencia: transmision dificil de detectar y bloquear. militares, bluetooth, versiones anteriores de 802.11
    + espectro directo de secuencia directa: multiples señales comparten ancho de banda. cdma, gps, 802.11b
    + uwb
*** radiotransmision
    + las ondas de radio son faciles de generar, recorren largas distancias y penetran edificios
    + son omnidireccionales
    + las propiedades dependen de la frecuencia. baja frecuencia: cruzan obstaculos pero se reduce la potencia rapidamente. alta frecuencia: viajan en linea recta y rebotan en obstaculos
    + ondas de alta frecuencia son absorbidas por la lluvia y otros obstaculos
    + como recorren grandes distancia la interferencia es un problema
    + estan reguladas por los gobiernos
    + vlf, lf y mf siguen la curvatura de la tierra. hf van en linea recta y rebotan en la ionosfera, tambien son absorbidas por la tierra
*** transmision por microondas
    + relacion S/N alta, pero las antenas deben estar alineadas
    + microondas no atraviesan bien los edificios
    + comunicacion telefonica, celulares, television. lo que provoco escasez de espectro
*** transmision infrarroja
    + comunicacion de corto alcance
    + no atraviesan objetos
*** tranmision por ondas de luz
    + señalizacion optica mediante laser
    + gran ancho de banda a bajo costo y seguro. pero muy dificil de apuntar
** satelites de comunicacion
   + un satelite es un enorme repetidor de microondas con varios transpondedores. transmite en modo *tublo doblado*
   + posicion de los satelites limitadas por el cinturon de van allen
*** satelites geoestacionarios
    + satelites que orbitan a la misma velocidad de la que rota la tierra. parecen inmoviles desde el suelo
    + los primeros tenian un solo haz de luz que iluminaba la tierra, lo que se conoce como huella
    + actualmente tienen multiples haces que se enfocan en una pequeña area geografica. estos son los haces puntuales
    + vsat: terminales muy pequeñas que se utilizan para la transmision de tv
    + los vsat no se pueden comunicar entre ellos por su baja potencia. para ello usan de intermediario potentes estaciones en la tierra
    + aunque las señales viajen a la velocidad de la luz, dada las distancias tienen mas retardo que las comunicaciones terrestres
    + los satelites son medios de difusion por naturaleza
*** ventajas de los satelites sobre la fibra optica
    + cuando se requiere un despliegue rapido, ganan los satelites
    + los satelites pueden enviar a cualquier parte del mundo
    + un mensaje que envia un satelite lo pueden recibir miles de estaciones al mismo tiempo
** modulacion digital y multiplexacion
   + modulacion digital: proceso de convertir bits en la señal que los representan
   + transmision en banda base: la señal ocupa una frecuencia desde 0 hasta un valor maximo que depende de la tasa de señalizacion. comun en cables
   + transmision pasa-banda: la señal ocupa una banda de frecuencias alrededor de la frecuencia de la señal portadora. comun en inalambrico y optico
   + multiplexacion: a compartir varias señales por un mismo canal
*** transmision en banda base
    + NRZ(non-return-to-zero): voltaje positivo para el 1 y uno nulo para el 0
    + el receptor muestrea a intervalos regulares y convierte de nuevo a bits. la señal no se vera igual a la que se envio por el ruido y el canal
    + eficiencia del ancho de banda
     + con nrz la señal puede alternar entre positivo y negativo hasta cada 2 bits. necesita un ancho de banda B/2hz pasa tasa de B bps
     + una estategia es usar mas de 2 niveles de señalizacion. por ejemplo 4 voltajes para representar 2 bits a la vez como un simbolo
     + tasa de bits=tasa de simbolo*bits por simbolo
     + requiere una potencia mayor en el receptor para diferenciar los niveles
    + recuperacion del reloj
     + el receptor debe saber cuando termina un simbolo y empieza otro
     + existe un limite en la precision de un reloj para muestrear señales
     + se podria enviar una señal del reloj por otra linea separada, pero seria mejor que si hubiera otra linea se usara para enviar datos
     + un truco seria usar xor entre las dos lineas para enviarlas en una sola. esta es la codificacion manchester y se usaba en ethernet clasico. lo malo es que requiere el doble de ancho de banda
     + una estrategia distinta es codificar los datos para que haya suficientes transiciones en la señal. ya que los problemas suceden en largas suceciones de 0 o 1
     + nrzi: 1 como una transicion y 0 como no hay transicion. usb usa este metodo. largas sucesiones de 1 no tienen problemas, pero de 0 si
     + 4b/5b: se asocian grupos de 4 bits a 5 bits segun una tabla fija, de manera que nunca haya tres 0 seguidos. agrega 25% de sobrecarga. sobran 16 numeros de 5 bits, algunos se usan para control
     + para asegurar transiciones se puede hacer xor con una secuencia pseudoaleatoria. el receptor decodifica con la misma secuencia. esta debe ser facil de generar
     + pero la aleatorizacion no garantiza transiciones
    + señales balanceadas
     + señales que tienen misma cantidad de voltajes positivos como negativos
     + ayuda a proveer transiciones para la recuperacion del reloj
     + codificacion bipolar: se alterna +1 y -1 voltios para el 1 y 0 voltios para el 0. en redes telefonicas ami
     + 8b/10b tambien para codigo balanceado
*** transmision pasa-banda
    + en canales inalambricos no es practico usar rango de frecuencias que empiecen en 0
    + se puede tomar una señal en banda base que ocupe de 0 a b hz y desplazarla a otra pasa-banda que ocupe de s a s+b hz
    + se puede modular la amplitud (ask), la frecuencia (fsk) o la fase (psk)
    + psk puede ser bpsk (binaria) o qpsk (cuadratura)
    + se pueden combinar y usar mas niveles, comunmente amplitud y fase
    + diagrama de constelacion: forma de visualizar la modulacion combinada ask y psk. qpsk, qam-16, qam-64
    + simbolos adyacentes no deben diferir en muchos bits, porque serian mas suceptibles al ruido. para eso se usa codigo gray
