com/com.tex
\subsubsection{lineas electricas}
\label{sec:orgaad6012}
\begin{itemize}
\item las compañias las han utilizado para comunicacion de baja velocidad
\item uso en el hogar para controlar dispositivos
\item dificil porque el cableado de las casas no esta hecho para enviar señales a alta frecuencia
\end{itemize}
\subsubsection{fibra optica}
\label{sec:org3966491}
\begin{itemize}
\item lan, internet y ftth
\item un pulso de luz indica 1, la ausencia 0
\item cuando la luz pasa de un medio a otro (silice a aire) se refracta. el grado depende de los indices de refraccion de los medios. y para cualquier angulo mayor a un angulo critico la luz rebota completamente en el silice
\item fibra multimodal: varios rayos de luz en una fibra
\item fibra monomodo: un solo rayo de luz por fibra que es mucho mas angosta
\item tres bandas: 0.85 1.3 y 1.55 micras. anchos de banda de 25000 a 30000 ghz. la primera tiene mas atenuacion
\item fuentes: led y laser
\end{itemize}
\subsection{transmision inalambrica}
\label{sec:orgdb6826f}
\subsubsection{espectro electromagnetico}
\label{sec:org00571c4}
\begin{itemize}
\item los electrones se mueven y crean ondas electromagneticas
\item las ondas viajan siempre a la velocidad de la luz
\item \(\lambda f=c\)
\item espectro directo con salto de frecuencia: transmision dificil de detectar y bloquear. militares, bluetooth, versiones anteriores de 802.11
\item espectro directo de secuencia directa: multiples señales comparten ancho de banda. cdma, gps, 802.11b
\item uwb
\end{itemize}
\subsubsection{radiotransmision}
\label{sec:orge56b7b5}
\begin{itemize}
\item las ondas de radio son faciles de generar, recorren largas distancias y penetran edificios
\item son omnidireccionales
\item las propiedades dependen de la frecuencia. baja frecuencia: cruzan obstaculos pero se reduce la potencia rapidamente. alta frecuencia: viajan en linea recta y rebotan en obstaculos
\item ondas de alta frecuencia son absorbidas por la lluvia y otros obstaculos
\item como recorren grandes distancia la interferencia es un problema
\item estan reguladas por los gobiernos
\item vlf, lf y mf siguen la curvatura de la tierra. hf van en linea recta y rebotan en la ionosfera, tambien son absorbidas por la tierra
\end{itemize}
\subsubsection{transmision por microondas}
\label{sec:orgc7f7fcb}
\begin{itemize}
\item relacion S/N alta, pero las antenas deben estar alineadas
\item microondas no atraviesan bien los edificios
\item comunicacion telefonica, celulares, television. lo que provoco escasez de espectro
\end{itemize}
\subsubsection{transmision infrarroja}
\label{sec:org3e85517}
\begin{itemize}
\item comunicacion de corto alcance
\item no atraviesan objetos
\end{itemize}
\subsubsection{tranmision por ondas de luz}
\label{sec:org3e47c73}
\begin{itemize}
\item señalizacion optica mediante laser
\item gran ancho de banda a bajo costo y seguro. pero muy dificil de apuntar
\end{itemize}
\subsection{satelites de comunicacion}
\label{sec:org42d93f8}
\begin{itemize}
\item un satelite es un enorme repetidor de microondas con varios transpondedores. transmite en modo \textbf{tublo doblado}
\item posicion de los satelites limitadas por el cinturon de van allen
\end{itemize}
\subsubsection{satelites geoestacionarios}
\label{sec:orgee4cde1}
\begin{itemize}
\item satelites que orbitan a la misma velocidad de la que rota la tierra. parecen inmoviles desde el suelo
\item los primeros tenian un solo haz de luz que iluminaba la tierra, lo que se conoce como huella
\item actualmente tienen multiples haces que se enfocan en una pequeña area geografica. estos son los haces puntuales
\item vsat: terminales muy pequeñas que se utilizan para la transmision de tv
\item los vsat no se pueden comunicar entre ellos por su baja potencia. para ello usan de intermediario potentes estaciones en la tierra
\item aunque las señales viajen a la velocidad de la luz, dada las distancias tienen mas retardo que las comunicaciones terrestres
\item los satelites son medios de difusion por naturaleza
\end{itemize}
\subsubsection{ventajas de los satelites sobre la fibra optica}
\label{sec:orge828b37}
\begin{itemize}
\item cuando se requiere un despliegue rapido, ganan los satelites
\item los satelites pueden enviar a cualquier parte del mundo
\item un mensaje que envia un satelite lo pueden recibir miles de estaciones al mismo tiempo
\end{itemize}
\subsection{modulacion digital y multiplexacion}
\label{sec:org2c4866a}
\begin{itemize}
\item modulacion digital: proceso de convertir bits en la señal que los representan
\item transmision en banda base: la señal ocupa una frecuencia desde 0 hasta un valor maximo que depende de la tasa de señalizacion. comun en cables
\item transmision pasa-banda: la señal ocupa una banda de frecuencias alrededor de la frecuencia de la señal portadora. comun en inalambrico y optico
\item multiplexacion: a compartir varias señales por un mismo canal
\end{itemize}
\subsubsection{transmision en banda base}
\label{sec:org4d6e527}
\begin{itemize}
\item NRZ(non-return-to-zero): voltaje positivo para el 1 y uno nulo para el 0
\item el receptor muestrea a intervalos regulares y convierte de nuevo a bits. la señal no se vera igual a la que se envio por el ruido y el canal
\item eficiencia del ancho de banda
\begin{itemize}
\item con nrz la señal puede alternar entre positivo y negativo hasta cada 2 bits. necesita un ancho de banda B/2hz pasa tasa de B bps
\item una estategia es usar mas de 2 niveles de señalizacion. por ejemplo 4 voltajes para representar 2 bits a la vez como un simbolo
\item tasa de bits=tasa de simbolo*bits por simbolo
\item requiere una potencia mayor en el receptor para diferenciar los niveles
\end{itemize}
\item recuperacion del reloj
\begin{itemize}
\item el receptor debe saber cuando termina un simbolo y empieza otro
\item existe un limite en la precision de un reloj para muestrear señales
\item se podria enviar una señal del reloj por otra linea separada, pero seria mejor que si hubiera otra linea se usara para enviar datos
\item un truco seria usar xor entre las dos lineas para enviarlas en una sola. esta es la codificacion manchester y se usaba en ethernet clasico. lo malo es que requiere el doble de ancho de banda
\item una estrategia distinta es codificar los datos para que haya suficientes transiciones en la señal. ya que los problemas suceden en largas suceciones de 0 o 1
\item nrzi: 1 como una transicion y 0 como no hay transicion. usb usa este metodo. largas sucesiones de 1 no tienen problemas, pero de 0 si
\item 4b/5b: se asocian grupos de 4 bits a 5 bits segun una tabla fija, de manera que nunca haya tres 0 seguidos. agrega 25\% de sobrecarga. sobran 16 numeros de 5 bits, algunos se usan para control
\item para asegurar transiciones se puede hacer xor con una secuencia pseudoaleatoria. el receptor decodifica con la misma secuencia. esta debe ser facil de generar
\item pero la aleatorizacion no garantiza transiciones
\end{itemize}
\item señales balanceadas
\begin{itemize}
\item señales que tienen misma cantidad de voltajes positivos como negativos
\item ayuda a proveer transiciones para la recuperacion del reloj
\item codificacion bipolar: se alterna +1 y -1 voltios para el 1 y 0 voltios para el 0. en redes telefonicas ami
\item 8b/10b tambien para codigo balanceado
\end{itemize}
\end{itemize}
\subsubsection{transmision pasa-banda}
\label{sec:orgd2ad55e}
\begin{itemize}
\item en canales inalambricos no es practico usar rango de frecuencias que empiecen en 0
\item se puede tomar una señal en banda base que ocupe de 0 a b hz y desplazarla a otra pasa-banda que ocupe de s a s+b hz
\item se puede modular la amplitud (ask), la frecuencia (fsk) o la fase (psk)
\item psk puede ser bpsk (binaria) o qpsk (cuadratura)
\item se pueden combinar y usar mas niveles, comunmente amplitud y fase
\item diagrama de constelacion: forma de visualizar la modulacion combinada ask y psk. qpsk, qam-16, qam-64
\item simbolos adyacentes no deben diferir en muchos bits, porque serian mas suceptibles al ruido. para eso se usa codigo gray
\end{itemize}
