com/com.org
*** protocolos de acceso multiple con deteccion de portadora
    + csma persistente-1
      + la estacion escucha el canal para ver si alguien esta enviando, sino envia. si ocurre una colision espera y manda de nuevo
      + el retardo de propagacion tiene un efecto importante en las colisiones. esta posibilidad depende del numero de tramas que quepan, o producto de ancho de banda-retardo
      + en lan como el retardo es pequeño, no habra muchas colisiones
    + csma no persistente
      + a diferencia del persistente-1 si el canal esta en uso espera un tiempo y repite el proceso. no se queda escuchando constantemente
      + mejor uso del canal pero mayor retardo
    + csma persistente-p
      + para canales ranurados
      + si el canal esta inactivo, envia con probabilidad p y espera a la siguiente ranura con probabilidad 1-p
    + csma con deteccion de colisiones (csma/cd)
      + base de la clasica ethernet
      + el hardware escucha a la vez que envia. si la señal que recibe es distinta a la que envia, esta ocurriendo una colision
      + periodos alternantes de contencion y transmision con periodos de inactividad que ocurriran cuando todas las estaciones esten en reposo
*** protocolos libres de colisiones
    + protocolo de mapa de bits
      + cada periodo de contencion consiste en n ranuras
      + las estaciones envian 1 si tienen tramas para enviar en ese periodo pero solo en su ranura correspondiente
      + luego cuando ya hay conocimiento de quien va a mandar mandan las tramas en orden
      + protocolos de revervacion
    + paso de token
      + pasa un pequeño mensaje llamado token de una estacion a otra en un orden determinado. token ring
      + solo puede enviar la que tenga el token
      + cuando la estacion que envio recibe su misma trama la elimina para terminar el ciclo
      + no hace falta que sea un anillo. token bus
    + conteo descendente binario
      + anteriores no escalan a redes con miles de estaciones
      + las estaciones que quieren usar el canal envian su direccion binaria y hacen or de todo lo que reciben
      + tan pronto como una estacion ve que una posicion de bit de orden alto, cuya direccion es 0, ha sido sobreescrita por un 1, se da por vencida
*** protocolos de contencion limitada
   + en condicion de carga ligera es preferible contencion
   + al reves para libres de colision
   + protocolos de contencion limitada combinan los dos anteriores
   + protocolo de recorrido de arbol adaptable
    + en la ranura 0 todas las estaciones intentan adquirir el canal. si una lo logra bien y sino se dividen en dos grupos y se va formando un arbol de decision
    + a mayor carga la busqueda debe iniciar mas abajo en el arbol
*** protocolos de lan inalambrica
   + problema de la terminal oculta
   + problema de la terminal expuesta
   + maca (acceso multiple con prevencion de colisiones)
     + el emisor estimula al receptor para que envie una trama corta. las estaciones cercanas tambien escuchan y evitan enviar a la vez
     + rts/cts
     + en caso de colision un transmisor espera un tiempo y vuelve a intentar de nuevo
** ethernet
   + 802.3
   + ethernet clasica (visto hasta ahora) y conmutada (switches)
*** capa fisica de ethernet clasica
    + un solo cable de donde se conectaban todas las maquinas
    + ethernet gruesa 500m y 100 maquinas
    + ethernet delgada 185m y 30 maquinas
    + longitud maxima por segmento conectada con repetidores
*** protocolo de subcapa mac para ethernet clasica
    + multidifusion (a un grupo de estaciones) y difusion (a todas)
    + direcciones globalmente unicas
    + el tipo especifica a que proceso darle la trama
    + campos tipo y longitud en conflicto. despues se usaron los dos: se interpreta segun si es mayor a la maxima longitud
    + tamaño de trama maximo y minimo. se puede rellenar
    + csma/cd
      + tras una colision el tiempo se divide en ranuras discretas de longitud igual a la ida y vuelta para el peor caso del cable
      + retroceso exponencial binario: despues de la colision n cada estacion espera de 0 a 2^n-1 ranuras para enviar de nuevo
*** ethernet conmutada
    + se empezaron a usar hubs en vez de un solo cable
    + las redes se podian saturar porque los hubs no incrementan la capacidad. de ahi se empezaron a usar los switch
    + los switches envian tramas solo a los puertos para los que estan destinadas
    + en un switch cada puerto es su dominio de colision independiente
    + si el cable es full duplex (comun) no hay colisiones. si es half duplex se usa csma/cd
    + en un hub las tramas se envian a todos, aumentando la probabilidad de intrusos
    + un switch puede tener conectado un hub, asi actua como un concentrador
*** fast ethernet
    + se mantuvo la ethernet anterior pero mas rapida
    + se permiten tres medios: par trenzado categoria 3 y 5, fibra optica
    + casi todos los switches pueden manejar 10mbps (anterior) o 100mbps (fast)
*** gigabit ethernet
    + en half duplex se usa csma/cd, en full duplex no
    + con 1gbps una trama minima que es enviada no llegaria a recorrer el cable antes que termine de enviar, por eso de limito la longitud a 200m
    + extension de portadora: el hardware agrega datos para hacer la trama de 512 bytes. no hay que hacer cambios de software
    + rafaga de tramas: el emisor envia una secuencia de tramas concatenadas en una sola transmision. si hay suficientes tramas, es preferible a la extension de portadora
    + en la actualidad la mayoria de las interfaces ethernet soportan los 3 tipos
*** 10 gigabit ethernet
** redes lan inalambricas
   + medio de comunicacion ondas electromagneticas
   + tres tipos de redes: wpan, wlan, wwan
   + modelos basados en pila: osi, tcp/ip, otros
