com/com.tex
\subsubsection{protocolos de acceso multiple con deteccion de portadora}
\label{sec:orgcafde60}
\begin{itemize}
\item csma persistente-1
\begin{itemize}
\item la estacion escucha el canal para ver si alguien esta enviando, sino envia. si ocurre una colision espera y manda de nuevo
\item el retardo de propagacion tiene un efecto importante en las colisiones. esta posibilidad depende del numero de tramas que quepan, o producto de ancho de banda-retardo
\item en lan como el retardo es pequeño, no habra muchas colisiones
\end{itemize}
\item csma no persistente
\begin{itemize}
\item a diferencia del persistente-1 si el canal esta en uso espera un tiempo y repite el proceso. no se queda escuchando constantemente
\item mejor uso del canal pero mayor retardo
\end{itemize}
\item csma persistente-p
\begin{itemize}
\item para canales ranurados
\item si el canal esta inactivo, envia con probabilidad p y espera a la siguiente ranura con probabilidad 1-p
\end{itemize}
\item csma con deteccion de colisiones (csma/cd)
\begin{itemize}
\item base de la clasica ethernet
\item el hardware escucha a la vez que envia. si la señal que recibe es distinta a la que envia, esta ocurriendo una colision
\item periodos alternantes de contencion y transmision con periodos de inactividad que ocurriran cuando todas las estaciones esten en reposo
\end{itemize}
\end{itemize}
\subsubsection{protocolos libres de colisiones}
\label{sec:org58bc1e8}
\begin{itemize}
\item protocolo de mapa de bits
\begin{itemize}
\item cada periodo de contencion consiste en n ranuras
\item las estaciones envian 1 si tienen tramas para enviar en ese periodo pero solo en su ranura correspondiente
\item luego cuando ya hay conocimiento de quien va a mandar mandan las tramas en orden
\item protocolos de revervacion
\end{itemize}
\item paso de token
\begin{itemize}
\item pasa un pequeño mensaje llamado token de una estacion a otra en un orden determinado. token ring
\item solo puede enviar la que tenga el token
\item cuando la estacion que envio recibe su misma trama la elimina para terminar el ciclo
\item no hace falta que sea un anillo. token bus
\end{itemize}
\item conteo descendente binario
\begin{itemize}
\item anteriores no escalan a redes con miles de estaciones
\item las estaciones que quieren usar el canal envian su direccion binaria y hacen or de todo lo que reciben
\item tan pronto como una estacion ve que una posicion de bit de orden alto, cuya direccion es 0, ha sido sobreescrita por un 1, se da por vencida
\end{itemize}
\end{itemize}
\subsubsection{protocolos de contencion limitada}
\label{sec:orgb131528}
\begin{itemize}
\item en condicion de carga ligera es preferible contencion
\item al reves para libres de colision
\item protocolos de contencion limitada combinan los dos anteriores
\item protocolo de recorrido de arbol adaptable
\begin{itemize}
\item en la ranura 0 todas las estaciones intentan adquirir el canal. si una lo logra bien y sino se dividen en dos grupos y se va formando un arbol de decision
\item a mayor carga la busqueda debe iniciar mas abajo en el arbol
\end{itemize}
\end{itemize}
\subsubsection{protocolos de lan inalambrica}
\label{sec:org833ee7f}
\begin{itemize}
\item problema de la terminal oculta
\item problema de la terminal expuesta
\item maca (acceso multiple con prevencion de colisiones)
\begin{itemize}
\item el emisor estimula al receptor para que envie una trama corta. las estaciones cercanas tambien escuchan y evitan enviar a la vez
\item rts/cts
\item en caso de colision un transmisor espera un tiempo y vuelve a intentar de nuevo
\end{itemize}
\end{itemize}
\subsection{ethernet}
\label{sec:orgf31d1da}
\begin{itemize}
\item 802.3
\item ethernet clasica (visto hasta ahora) y conmutada (switches)
\end{itemize}
\subsubsection{capa fisica de ethernet clasica}
\label{sec:orgb329568}
\begin{itemize}
\item un solo cable de donde se conectaban todas las maquinas
\item ethernet gruesa 500m y 100 maquinas
\item ethernet delgada 185m y 30 maquinas
\item longitud maxima por segmento conectada con repetidores
\end{itemize}
\subsubsection{protocolo de subcapa mac para ethernet clasica}
\label{sec:orge4531cc}
\begin{itemize}
\item multidifusion (a un grupo de estaciones) y difusion (a todas)
\item direcciones globalmente unicas
\item el tipo especifica a que proceso darle la trama
\item campos tipo y longitud en conflicto. despues se usaron los dos: se interpreta segun si es mayor a la maxima longitud
\item tamaño de trama maximo y minimo. se puede rellenar
\item csma/cd
\begin{itemize}
\item tras una colision el tiempo se divide en ranuras discretas de longitud igual a la ida y vuelta para el peor caso del cable
\item retroceso exponencial binario: despues de la colision n cada estacion espera de 0 a 2\textsuperscript{n}-1 ranuras para enviar de nuevo
\end{itemize}
\end{itemize}
\subsubsection{ethernet conmutada}
\label{sec:orge676d81}
\begin{itemize}
\item se empezaron a usar hubs en vez de un solo cable
\item las redes se podian saturar porque los hubs no incrementan la capacidad. de ahi se empezaron a usar los switch
\item los switches envian tramas solo a los puertos para los que estan destinadas
\item en un switch cada puerto es su dominio de colision independiente
\item si el cable es full duplex (comun) no hay colisiones. si es half duplex se usa csma/cd
\item en un hub las tramas se envian a todos, aumentando la probabilidad de intrusos
\item un switch puede tener conectado un hub, asi actua como un concentrador
\end{itemize}
\subsubsection{fast ethernet}
\label{sec:orga8520dc}
\begin{itemize}
\item se mantuvo la ethernet anterior pero mas rapida
\item se permiten tres medios: par trenzado categoria 3 y 5, fibra optica
\item casi todos los switches pueden manejar 10mbps (anterior) o 100mbps (fast)
\end{itemize}
\subsubsection{gigabit ethernet}
\label{sec:org884a886}
\begin{itemize}
\item en half duplex se usa csma/cd, en full duplex no
\item con 1gbps una trama minima que es enviada no llegaria a recorrer el cable antes que termine de enviar, por eso de limito la longitud a 200m
\item extension de portadora: el hardware agrega datos para hacer la trama de 512 bytes. no hay que hacer cambios de software
\item rafaga de tramas: el emisor envia una secuencia de tramas concatenadas en una sola transmision. si hay suficientes tramas, es preferible a la extension de portadora
\item en la actualidad la mayoria de las interfaces ethernet soportan los 3 tipos
\end{itemize}
\subsubsection{10 gigabit ethernet}
\label{sec:org57b0721}
\subsection{redes lan inalambricas}
\label{sec:orgd42978a}
\begin{itemize}
\item medio de comunicacion ondas electromagneticas
\item tres tipos de redes: wpan, wlan, wwan
\item modelos basados en pila: osi, tcp/ip, otros
\end{itemize}
