com/com.org
*** wi-fi o wlan
    + capa fisica y enlace de osi
    + 802.11
    + arquitectura celular: el sistema se subdivide en celdas. cada celda (bss) se controla por una estacion (ap)
    + la capa fisica
      + funciones
        + codificacion/decodificacion de las señales
        + generacion/remocion de cabeceras
        + transmision/recepcion de bits
        + especificaciones del medio de transmision
      + fhss(espectro disperso con salto de frecuencia): transmision en intervalos de tiempo a frecuencias distintas que el emisor y el receptor conocen. resistente al ruido y mas seguro
      + dsss(espectro disperso con secuencia directa): transmitir con una secuencia de bits de alta velocidad llamados chips. secuencia de barker
      + mimo(multiple entrada/multiple salida): aparatos con varias antenas para generar subcanales de transmision
    + capa de enlace
      + funciones
        + capa control acceso al medio
	  + transmision: ensamblado de datos en tramas con campos de direccionamiento y deteccion de errores
	  + recepcion: desensamblado de tramas, reconocimiento de direcciones y deteccione de errores
	  + administra acceso al medio de transmision
        + capa control de enlace logico
          + interface a las capas superiores, control de errores y flujo
      + a diferencia de ethernet para wifi debe haber acuse de recibo
      + puede darle el problema de que una estacion no llegue a escuchar cuando otra en la misma red este mandando y se produzcan colisiones. estacion oculta
      + rts/cts
      + dcf: mecanismo basico de csma/ca. primero se verifica que nadie use el canal. las estaciones retardan aleatoriamente las tramas y luego escuchan para evitar colisiones. a veces usan rts/cts
      + pcf: tecnica de interrogacion circular desde el ap. servicios de tipo sincrono
    + funciones de deteccion de portadoras
      + para deetrminar si el medio se encuentra disponible
      + dos tipos: de la capa fisica y deteccion de portadoras virtuales(nav)
    + espaciamiento intertrama: cuatro diferentes espaciamientos para diferentes prioridades
    + tres tipos de trama: datos, control y gestion
    + control de enlace logico
      + direccionamiento de estaciones conectadas al medio y control de flujo
      + basado en el protocolo hdlc
      + 3 tipos de servicios: sin conexion y sin reconocimiento, con y sin, sin y con
*** wpan
   + dispositivos perifericos
   + bluetooth, homerf, zigbee, infrarrojo
   + bluetooth
     + clase 1, 2 y 3 segun la potencia
     + piconet
       + un nodo maestro y hasta 7 nodos esclavos activos. hasta 255 en total
       + puede haber varias piconets conectadas de un nodo esclavo puente(scatternet)
       + capa fisica
	 + sistema de baja potencia. pocos metros
	 + 79 canales de 1mhz. modulacion desplazamiento de frecuencia
	 + misma banda que 802.11 pero es mas problable que bluetooth interfiera con 802.11 que al reves
       + capa banda base
	 + perecido a la capa mac
	 + multiplexion por division de tiempo: el maestro transmite en ranuras pares y los esclavos en impares
         + enlace acl: capa l2cap. mejor esfuerzo
         + enlace sco: datos en tiempo real. se asigna una ranura fija a cada direccion. no se retransmiten datos
       + administrador de enlace
       + capa adaptacion y control de enlace logico(l2cap)
	 + acepta paquetes de capa superior y los divide en tramas
	 + maneja la multiplexion
	 + se encarga de la calidad de los requerimientos de servicio. establece enlaces, negocia el tamaño de carga util
   + bluetooth smart(ble)
     + 40 canales de 2mhz
     + no es directamente compatible con el anterior. si en modo dual(smart ready)
     + topologia broadcasting
       + enviar datos a cualquier dispositivo que este escuchando el medio
       + envia periodicamente paquetes de anuncio por canales especificos
     + topologia conexiones
       + conexion permanente y periodicamente se intercambian datos entre maestro y esclavo
     + un dispositivo puede ser maestro y esclavo. un maestro puede ser conectado a multiples esclavos. un esclavo a multiples maestros
     + perfiles genericos: perfil de acceso generico(gap), perfil de atributo generico(gatt)
     + capa de enlace
       + varios estados
	 + espera: no transmite ni recibe. modo ahorro
	 + anuncio: un esclavo envia paquetes en canales de anuncio. recibe tambien desde un maestro
	 + exploracion: escucha los paquetes de anuncio que envian los dispositivos
	 + inicializacion: usado por el maestro antes de iniciar una conexion. escucha hasta que recibe el anuncio de un esclavo deseado y se conecta
