com/com.tex
\subsubsection{wi-fi o wlan}
\label{sec:org8375c72}
\begin{itemize}
\item capa fisica y enlace de osi
\item 802.11
\item arquitectura celular: el sistema se subdivide en celdas. cada celda (bss) se controla por una estacion (ap)
\item la capa fisica
\begin{itemize}
\item funciones
\begin{itemize}
\item codificacion/decodificacion de las señales
\item generacion/remocion de cabeceras
\item transmision/recepcion de bits
\item especificaciones del medio de transmision
\end{itemize}
\item fhss(espectro disperso con salto de frecuencia): transmision en intervalos de tiempo a frecuencias distintas que el emisor y el receptor conocen. resistente al ruido y mas seguro
\item dsss(espectro disperso con secuencia directa): transmitir con una secuencia de bits de alta velocidad llamados chips. secuencia de barker
\item mimo(multiple entrada/multiple salida): aparatos con varias antenas para generar subcanales de transmision
\end{itemize}
\item capa de enlace
\begin{itemize}
\item funciones
\begin{itemize}
\item capa control acceso al medio
\begin{itemize}
\item transmision: ensamblado de datos en tramas con campos de direccionamiento y deteccion de errores
\item recepcion: desensamblado de tramas, reconocimiento de direcciones y deteccione de errores
\item administra acceso al medio de transmision
\end{itemize}
\item capa control de enlace logico
\begin{itemize}
\item interface a las capas superiores, control de errores y flujo
\end{itemize}
\end{itemize}
\item a diferencia de ethernet para wifi debe haber acuse de recibo
\item puede darle el problema de que una estacion no llegue a escuchar cuando otra en la misma red este mandando y se produzcan colisiones. estacion oculta
\item rts/cts
\item dcf: mecanismo basico de csma/ca. primero se verifica que nadie use el canal. las estaciones retardan aleatoriamente las tramas y luego escuchan para evitar colisiones. a veces usan rts/cts
\item pcf: tecnica de interrogacion circular desde el ap. servicios de tipo sincrono
\end{itemize}
\item funciones de deteccion de portadoras
\begin{itemize}
\item para deetrminar si el medio se encuentra disponible
\item dos tipos: de la capa fisica y deteccion de portadoras virtuales(nav)
\end{itemize}
\item espaciamiento intertrama: cuatro diferentes espaciamientos para diferentes prioridades
\item tres tipos de trama: datos, control y gestion
\item control de enlace logico
\begin{itemize}
\item direccionamiento de estaciones conectadas al medio y control de flujo
\item basado en el protocolo hdlc
\item 3 tipos de servicios: sin conexion y sin reconocimiento, con y sin, sin y con
\end{itemize}
\end{itemize}
\subsubsection{wpan}
\label{sec:org388464b}
\begin{itemize}
\item dispositivos perifericos
\item bluetooth, homerf, zigbee, infrarrojo
\item bluetooth
\begin{itemize}
\item clase 1, 2 y 3 segun la potencia
\item piconet
\begin{itemize}
\item un nodo maestro y hasta 7 nodos esclavos activos. hasta 255 en total
\item puede haber varias piconets conectadas de un nodo esclavo puente(scatternet)
\item capa fisica
\begin{itemize}
\item sistema de baja potencia. pocos metros
\item 79 canales de 1mhz. modulacion desplazamiento de frecuencia
\item misma banda que 802.11 pero es mas problable que bluetooth interfiera con 802.11 que al reves
\end{itemize}
\item capa banda base
\begin{itemize}
\item perecido a la capa mac
\item multiplexion por division de tiempo: el maestro transmite en ranuras pares y los esclavos en impares
\item enlace acl: capa l2cap. mejor esfuerzo
\item enlace sco: datos en tiempo real. se asigna una ranura fija a cada direccion. no se retransmiten datos
\end{itemize}
\item administrador de enlace
\item capa adaptacion y control de enlace logico(l2cap)
\begin{itemize}
\item acepta paquetes de capa superior y los divide en tramas
\item maneja la multiplexion
\item se encarga de la calidad de los requerimientos de servicio. establece enlaces, negocia el tamaño de carga util
\end{itemize}
\end{itemize}
\end{itemize}
\item bluetooth smart(ble)
\begin{itemize}
\item 40 canales de 2mhz
\item no es directamente compatible con el anterior. si en modo dual(smart ready)
\item topologia broadcasting
\begin{itemize}
\item enviar datos a cualquier dispositivo que este escuchando el medio
\item envia periodicamente paquetes de anuncio por canales especificos
\end{itemize}
\item topologia conexiones
\begin{itemize}
\item conexion permanente y periodicamente se intercambian datos entre maestro y esclavo
\end{itemize}
\item un dispositivo puede ser maestro y esclavo. un maestro puede ser conectado a multiples esclavos. un esclavo a multiples maestros
\item perfiles genericos: perfil de acceso generico(gap), perfil de atributo generico(gatt)
\item capa de enlace
\begin{itemize}
\item varios estados
\begin{itemize}
\item espera: no transmite ni recibe. modo ahorro
\item anuncio: un esclavo envia paquetes en canales de anuncio. recibe tambien desde un maestro
\item exploracion: escucha los paquetes de anuncio que envian los dispositivos
\item inicializacion: usado por el maestro antes de iniciar una conexion. escucha hasta que recibe el anuncio de un esclavo deseado y se conecta
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}
