com/com.org
*** sistema de telefonia y comunicaciones moviles
    + division celular: dividir en zonas pequeñas donde se reutilizan canales disponibles
    + reutilizacion de frecuencias
      + se asigna a cada celda un grupo de frecuencias, de modo que no se compartan con celdas vecinas
      + el grupo de celdas que no comparten canales se llama cluster
    + modo de funcionamiento
      + simplex: no se puede transmitir y recibir simultaneamente por enlaces de subida y bajada
      + duplex: los dos enlaces usan portadoras distintas y se pueden usar a la vez
    + desde 1g hasta 4g+. 5g sin estandarizar
    + arquitectura
      + equipo de usuario: contiene una tarjeta que le permita usar el servicio. se conecta a traves de una interfaz de radio
      + red de acceso: sustenta la transmision de radio con los usuarios para conectarlos con la red troncal
      + red troncal: control de acceso, gestion de movilidad, gestion de sesiones de datos, etc
    + tipos de redes de acceso: gerand/utran(3g) y e-utran(lte)
    + la red troncal se divide en tres
      + dominio de circuitos: todas las entidades que dan servicios basados en conmutacion de circuitos. accesible a traves de geran y utran, e-utran no usa
      + dominio de paquetes: basado en conmutacion de paquetes. dos implementaciones: gprs y epc. gprs fue la primera en contexto de las redes anteriores. epc es la nueva de lte
      + subsistema ims: provision de servicios ip basados en el protocolo sip. asociada a lo multimedia y utiliza servicios del dominio de paquetes
    + arquitectura de lte
      + eps(evolved packet system), enteramente basada en paquetes ip, tanto servicios en tiempo real como transmision de datos
      + los componentes son: la red e-utran, el dominio de paquetes epc y el sistema ims
      + contempla el acceso al servicio de redes utran y geran, y otras redes que no pertenecen a la misma familia
      + la red de acceso se compone de una unica entidad enb, que proporciona conectividad entre usuarios y la red troncal
      + enb usa tres interfaces: e-utran uu(usuarios-enb), s1(enb-troncal) y x2(enb-enb)
    + capa fisica
      + ofdma para enlace descendente y sc-fdma para ascendente
      + qpsk, 16qam y 64qam descendente, qpsk, 64qam ascendente
    + interfaz de radio
      + tres tipos de transferencia: difusion de señalizacion de control, envio de paquetes ip y transferencia de señalizacion de control
    + ofdma
      + diversidad multiusuario: la asignacion de subportadoras se realizan dinamicamente
      + diversidad frecuencial: es posible asignar al usuario subportadoras no contiguas, suficientemente separadas
      + robustez en la propagacion multicamino: fuerte a la interferencia intersimbolica por la propagacion por multiples caminos
      + flexibilidad de banda asignada: permite acomodar las velocidades a usuarios segun lo que requieran
      + granularidad en recursos asignables: para acomodar servicios con diferente calidad
      + elevada relacion entre potencia media e instantanea
      + suceptibilidad a errores de frecuencia: cuando hay desplazamientos de frecuencia hay interferencias. se requieren mecanismos de sincronizacion
    + sc-fdma
      + variaciones reducidas entre potencia media e instantanea
      + posibilidad de llevar a cabo de forma sencilla mecanismos de ecualizacion en el dominio de la frecuencia
      + capacidad de proporcionar asignacion de banda flexible
** conmutacion de la capa de enlace de datos
   + lan de lanes con puentes
*** usos de puentes
    + universidades y departamentos tienen sus propias redes lan separadas, pero tambien requieren comunicarse entre ellas
    + la organizacion puede estar separada geograficamente
    + dividir una sola red lan en varias para alivianar la carga
    + dos algoritmos para que los puentes sean transparentes
*** puentes de aprendizaje
    + cada puerto del switch define un dominio de colision
    + si una estacion se quiere comunicar con otra dentro del mismo segmento el switch debe descartar las tramas porque no es necesario reenviarlas
    + mediante una tabla hash los switches saben a que segmento pertenecen las estaciones
    + cuando llega una trama al puente se fija la hora y actualiza el puerto si cambio. por si se modificaran las topologias
    + si no conoce por cual puerto enviar una trama. se envia a todos excepto por el que vino
    + *conmutacion al vuelo*: es posible empezar a reenviar ni bien se lea la cabezera de una trama, que contiene la direccion
*** puentes con arbol de expansion
    + enlaces redundantes. si se corta uno la red no se dividira en dos. pero crea ciclos en la topologia
    + los puentes ejecutan un algoritmo distribuido para construir el arbol
    + incluyen la distancia desde la raiz para recordar la ruta mas corta. desactivan los puertos que no formen parte de esa ruta
*** redes lan virtuales
    + agrupar a los usuarios en diferentes lan para reflejar la estructura de la organizacion
    + seguridad: por ejemplo separar servidores de computadoras de uso publico
    + carga: algunas lan se usan mucho mas que otras
    + trafico de difusion
    + las redes vlan se basan en switches diseñados para este proposito. el administrador decide cuantas vlan habra y como se llamaran
    + tablas de configuracion en los puentes. que vlan se puede acceder por un puerto
    + estandar 802.1q
      + se cambio el encabezado de ethernet. tiene una nueva etiqueta vlan
      + los campos de vlan no los deben ver los usuarios, solo puntes y conmutadores
      + cuando una trama llega al primer switch con soporte para vlan agrega los campos y el ultimo los elimina
* capa de red
** aspecto de diseño
*** conmutacion de paquetes de almacenamiento y reenvio
*** servicios proporcionados a la capa de transporte
    + independientes de la tecnologia del enrutador
    + la capa de transporte debe estar aislada del tipo, cantidad y topologia de enrutadores
    + plan de numeracion uniforme para las direcciones disponibles
*** implementacion del servicio sin conexion
    + los paquetes se transmiten por separado y se enrutan de manera independiente
    + datagramas
    + ip
*** implementacion del servicio orientado a la conexion
    + evitar la necesidad de elegir una nueva ruta para cada paquete enviado. cuando se establece una conexion se guarda la ruta
    + mpls: usa vez que se establece el circuito virtual los enrutadores intermedios asignan identificadores diferentes para origenes diferentes para diferenciarlos en una misma ruta
** algoritmos de enrutamiento
   + un enrutador tiene dos procesos internos: uno maneja cada paquete conforme llega y busca en la tabla de ruteo la linea de salida. el otro es llenar y actualizar las tablas de ruteo, y ahi es donde entra el algoritmo de ruteo
   + muchas redes intentan reducir el numero de saltos que debe dar un paquete
   + no adaptativos: no basan sus decisiones en mediciones de trafico y topologia actuales. las rutas se elijen de antemano. enrutamiento estatico
   + adaptativos: no no adaptativos. enrutamiento dinamico
*** principio de optimizacion
    + si una ruta es optima para i->j->k, tambien es optima para j->k
    + arbol sumidero: el conjunto de rutas optimas
*** algoritmo de la ruta mas corta
    + ver la red como un grafo y buscar el camino mas corto
    + corto puede ser el numero de saltos, distancia geografica, u otras metricas
