com/com.tex
\subsubsection{sistema de telefonia y comunicaciones moviles}
\label{sec:org35e6de2}
\begin{itemize}
\item division celular: dividir en zonas pequeñas donde se reutilizan canales disponibles
\item reutilizacion de frecuencias
\begin{itemize}
\item se asigna a cada celda un grupo de frecuencias, de modo que no se compartan con celdas vecinas
\item el grupo de celdas que no comparten canales se llama cluster
\end{itemize}
\item modo de funcionamiento
\begin{itemize}
\item simplex: no se puede transmitir y recibir simultaneamente por enlaces de subida y bajada
\item duplex: los dos enlaces usan portadoras distintas y se pueden usar a la vez
\end{itemize}
\item desde 1g hasta 4g+. 5g sin estandarizar
\item arquitectura
\begin{itemize}
\item equipo de usuario: contiene una tarjeta que le permita usar el servicio. se conecta a traves de una interfaz de radio
\item red de acceso: sustenta la transmision de radio con los usuarios para conectarlos con la red troncal
\item red troncal: control de acceso, gestion de movilidad, gestion de sesiones de datos, etc
\end{itemize}
\item tipos de redes de acceso: gerand/utran(3g) y e-utran(lte)
\item la red troncal se divide en tres
\begin{itemize}
\item dominio de circuitos: todas las entidades que dan servicios basados en conmutacion de circuitos. accesible a traves de geran y utran, e-utran no usa
\item dominio de paquetes: basado en conmutacion de paquetes. dos implementaciones: gprs y epc. gprs fue la primera en contexto de las redes anteriores. epc es la nueva de lte
\item subsistema ims: provision de servicios ip basados en el protocolo sip. asociada a lo multimedia y utiliza servicios del dominio de paquetes
\end{itemize}
\item arquitectura de lte
\begin{itemize}
\item eps(evolved packet system), enteramente basada en paquetes ip, tanto servicios en tiempo real como transmision de datos
\item los componentes son: la red e-utran, el dominio de paquetes epc y el sistema ims
\item contempla el acceso al servicio de redes utran y geran, y otras redes que no pertenecen a la misma familia
\item la red de acceso se compone de una unica entidad enb, que proporciona conectividad entre usuarios y la red troncal
\item enb usa tres interfaces: e-utran uu(usuarios-enb), s1(enb-troncal) y x2(enb-enb)
\end{itemize}
\item capa fisica
\begin{itemize}
\item ofdma para enlace descendente y sc-fdma para ascendente
\item qpsk, 16qam y 64qam descendente, qpsk, 64qam ascendente
\end{itemize}
\item interfaz de radio
\begin{itemize}
\item tres tipos de transferencia: difusion de señalizacion de control, envio de paquetes ip y transferencia de señalizacion de control
\end{itemize}
\item ofdma
\begin{itemize}
\item diversidad multiusuario: la asignacion de subportadoras se realizan dinamicamente
\item diversidad frecuencial: es posible asignar al usuario subportadoras no contiguas, suficientemente separadas
\item robustez en la propagacion multicamino: fuerte a la interferencia intersimbolica por la propagacion por multiples caminos
\item flexibilidad de banda asignada: permite acomodar las velocidades a usuarios segun lo que requieran
\item granularidad en recursos asignables: para acomodar servicios con diferente calidad
\item elevada relacion entre potencia media e instantanea
\item suceptibilidad a errores de frecuencia: cuando hay desplazamientos de frecuencia hay interferencias. se requieren mecanismos de sincronizacion
\end{itemize}
\item sc-fdma
\begin{itemize}
\item variaciones reducidas entre potencia media e instantanea
\item posibilidad de llevar a cabo de forma sencilla mecanismos de ecualizacion en el dominio de la frecuencia
\item capacidad de proporcionar asignacion de banda flexible
\end{itemize}
\end{itemize}
\subsection{conmutacion de la capa de enlace de datos}
\label{sec:orgc611736}
\begin{itemize}
\item lan de lanes con puentes
\end{itemize}
\subsubsection{usos de puentes}
\label{sec:org4cf9e9a}
\begin{itemize}
\item universidades y departamentos tienen sus propias redes lan separadas, pero tambien requieren comunicarse entre ellas
\item la organizacion puede estar separada geograficamente
\item dividir una sola red lan en varias para alivianar la carga
\item dos algoritmos para que los puentes sean transparentes
\end{itemize}
\subsubsection{puentes de aprendizaje}
\label{sec:org2f256d7}
\begin{itemize}
\item cada puerto del switch define un dominio de colision
\item si una estacion se quiere comunicar con otra dentro del mismo segmento el switch debe descartar las tramas porque no es necesario reenviarlas
\item mediante una tabla hash los switches saben a que segmento pertenecen las estaciones
\item cuando llega una trama al puente se fija la hora y actualiza el puerto si cambio. por si se modificaran las topologias
\item si no conoce por cual puerto enviar una trama. se envia a todos excepto por el que vino
\item \textbf{conmutacion al vuelo}: es posible empezar a reenviar ni bien se lea la cabezera de una trama, que contiene la direccion
\end{itemize}
\subsubsection{puentes con arbol de expansion}
\label{sec:orge7651e2}
\begin{itemize}
\item enlaces redundantes. si se corta uno la red no se dividira en dos. pero crea ciclos en la topologia
\item los puentes ejecutan un algoritmo distribuido para construir el arbol
\item incluyen la distancia desde la raiz para recordar la ruta mas corta. desactivan los puertos que no formen parte de esa ruta
\end{itemize}
\subsubsection{redes lan virtuales}
\label{sec:orgb2606dd}
\begin{itemize}
\item agrupar a los usuarios en diferentes lan para reflejar la estructura de la organizacion
\item seguridad: por ejemplo separar servidores de computadoras de uso publico
\item carga: algunas lan se usan mucho mas que otras
\item trafico de difusion
\item las redes vlan se basan en switches diseñados para este proposito. el administrador decide cuantas vlan habra y como se llamaran
\item tablas de configuracion en los puentes. que vlan se puede acceder por un puerto
\item estandar 802.1q
\begin{itemize}
\item se cambio el encabezado de ethernet. tiene una nueva etiqueta vlan
\item los campos de vlan no los deben ver los usuarios, solo puntes y conmutadores
\item cuando una trama llega al primer switch con soporte para vlan agrega los campos y el ultimo los elimina
\end{itemize}
\end{itemize}
\section{capa de red}
\label{sec:orgf4d9268}
\subsection{aspecto de diseño}
\label{sec:org21b4fff}
\subsubsection{conmutacion de paquetes de almacenamiento y reenvio}
\label{sec:org0ed0bab}
\subsubsection{servicios proporcionados a la capa de transporte}
\label{sec:orge1b6908}
\begin{itemize}
\item independientes de la tecnologia del enrutador
\item la capa de transporte debe estar aislada del tipo, cantidad y topologia de enrutadores
\item plan de numeracion uniforme para las direcciones disponibles
\end{itemize}
\subsubsection{implementacion del servicio sin conexion}
\label{sec:org4eb2879}
\begin{itemize}
\item los paquetes se transmiten por separado y se enrutan de manera independiente
\item datagramas
\item ip
\end{itemize}
\subsubsection{implementacion del servicio orientado a la conexion}
\label{sec:org69c6d1b}
\begin{itemize}
\item evitar la necesidad de elegir una nueva ruta para cada paquete enviado. cuando se establece una conexion se guarda la ruta
\item mpls: usa vez que se establece el circuito virtual los enrutadores intermedios asignan identificadores diferentes para origenes diferentes para diferenciarlos en una misma ruta
\end{itemize}
\subsection{algoritmos de enrutamiento}
\label{sec:orgc52428c}
\begin{itemize}
\item un enrutador tiene dos procesos internos: uno maneja cada paquete conforme llega y busca en la tabla de ruteo la linea de salida. el otro es llenar y actualizar las tablas de ruteo, y ahi es donde entra el algoritmo de ruteo
\item muchas redes intentan reducir el numero de saltos que debe dar un paquete
\item no adaptativos: no basan sus decisiones en mediciones de trafico y topologia actuales. las rutas se elijen de antemano. enrutamiento estatico
\item adaptativos: no no adaptativos. enrutamiento dinamico
\end{itemize}
\subsubsection{principio de optimizacion}
\label{sec:org28ce5f0}
\begin{itemize}
\item si una ruta es optima para i->j->k, tambien es optima para j->k
\item arbol sumidero: el conjunto de rutas optimas
\end{itemize}
\subsubsection{algoritmo de la ruta mas corta}
\label{sec:org90128d4}
\begin{itemize}
\item ver la red como un grafo y buscar el camino mas corto
\item corto puede ser el numero de saltos, distancia geografica, u otras metricas
\end{itemize}
