com/com.org
*** inundacion
    + tecnica local. el enrutador envia por todas las lineas excepto por la que vino el paquete
    + gran cantidad de duplicados
    + numero maximo de saltos en la cabecera
    + numero de secuencia en paquetes para no enviarlos dos veces
    + no es practico para la mayoria de envios. pero tienen usos importantes como la difusion, porque asegura que todas las estaciones reciban el paquete
    + es en extremo robusta
    + requiere poca configuracion
    + siempre encuentra la ruta mas corta, sin contar el congestionamiento que provoca el algoritmo
*** enrutamiento por vector de distancia
    + cada enrutador mantiene un vector (una tabla) con la mejor ruta para cada destino. esta tabla se va actualizando
    + cada T ms cada enrutador manda a sus vecinos su tabla
    + problema del conteo al infinito: la convergencia llega a la respuesta correcta, pero lo hace lentamente
*** enrutamiento por estados de enlace
    + las variantes is-is y ospf son usadas en la actualidad en internet
    + descrubrir a sus vecinos
      + cuando un enrutador se pone en funcionamiento envia paquetes por todas las lineas que son respondidos con informacion de los vecinos
*** enrutamiento jerarquico
*** enrutamiento por difusion
*** enrutamiento multidifusion
*** enrutamiento anycast
*** enrutamiento para hosts moviles
*** enrutamiento para redes ad hoc
** algoritmos de control de congestion
   + las capas de red y transposte manejan la congestion
   + el control de congestion lo hace la red como conjunto. control de flujo se hace entre un emisor y receptor en particular
*** metodos para control de congestion
    + la presencia de congestion significa que la carga es mayor que los recursos
    + la manera mas basica es contruir una red que coincida con el trafico que transmita
    + aprovisionamiento: enrutadores y enlaces que se utilicen mucho son los que se actualizan primero
    + enrutamiento conciente de trafico: las rutas se pueden ajustar segun patrones de trafico
    + cuando no es posible aumentar la capacidad hay que reducir la carga, como rechazar nuevas conexiones (control de admision)
    + reconocer cuando empieza la congestion: para eso se monitorean la carga promedio, retardo de encolamiento y perdida de paquetes
    + como avisar a las fuentes: debe haber retroalimentacion. hay que ajustar la escala de tiempo con cuidado
    + si falla todo hay que empezar a descartar paquetes
*** enrutamiento conciente de trafico
*** control de admision
    + usada en redes de circuitos virtuales
    + no agregar conexiones a menos que no lleve a congestion de la red
    + como saber cuando una conexion generara congestion?
    + describir tasa de transmision de una forma simple pero significativa es dificil
    + leaky bucket o token bucket: vincula la tasa promedio y el tamaño de la rafaga instantanea de trafico
    + se puede usar el comportamiento pasado para estimar el numero de circuitos que admite una red
*** regulacion de trafico
    + la red aspira a operar justo antes de que empiece la congestion
    + los enrutadores deben determinar cuando se acerca. se puede usar enlaces de salida, *bufer de paquetes en cola*, numero de paquetes que se pierden
    + tambien deben entregar una retroalimentacion a los que generan congestion
    + paquetes reguladores: se avisa al origen que su paquete provoca congestion, con un bit en el encabezado. el emisor puede esperar un poco y reenviar
    + notificacion explicita de congestion (ecn): el enrutador reenvia paquetes congestionados con el encabezado modificado. cualquiera que lo recibe sabe el estado de la red y actua
    + contrapresion de salto por salto: los paquetes reguladores surten efecto en todos los puntos intermedios
*** desprendimiento de carga
    + cual paquete tirar depende de la aplicacion
    + un desprendimiento mas inteligente requiere cooperacion de los emisores. por ejemplo paquetes que mandan informacion de enrutamiento
    + las aplicaciones pueden marcar que tan importante son los paquetes
** calidad de servicio
   + exceso de aprovisionamiento: contruir una red con la suficiente capacidad para el trafico que maneje. mas costoso. a veces no se puede predecir los cambios en la cantidad de trafico
   + cuatro aspectos para asegurar la calidad de servicio:
     + lo que las aplicaciones necesitan de la red
     + como regular el trafico que entra en la red
     + como reservar recursos en los enrutadores para garantizar el desempeño
     + si la red puede aceptar mas trafico de forma segura
*** requerimientos de la aplicacion
    + parametros que caracterizan las necesidades de cada flujo: ancho de banda, retardo, variacion de retardo, perdida
*** modelado de trafico
    + 
** ipv4
   + conmutacion de paquetes
   + servicio sin conexion
*** objetivos
    + funcion de ruteo
    + transparencia en la red de redes
    + reglas de entrega de paquetes no confiable
    + unidad basica: datagrama
*** formato
    + tamaño variable por posibilidad de incluir opciones
    + campo type of service para informar como debe ser tratado el paquete
*** fragmentacion
    + los datagramas pueden pasar por redes de mayor o menor mtu
    + cada router intermedio fragmenta los datos de acuerdo con el mtu de salida
    + los fragmentos son reensamblados una vez que llegan a destino
    + la fragmentacion se controla con campos en la cabecera
*** otros campos
    + ttl (time to live): cuanto tiempo en segundos un paquete puede estar en la red. si llega a 0 se envia un mensaje icmp de error al origen
    + protocol: indica el protocolo de nivel superior que fue usado
    + options: no estan incluidos en todos los datagramas
*** clases de direcciones
    + a: r.h.h.h. 1.0.0.0 a 126.0.0.0
    + b: r.r.h.h. 128.0.0.0 a 191.255.0.0
    + c: r.r.r.h. 192.0.0.0 a 223.255.255.0
    + d: multicast address. 224.0.0.0 a 239.255.255.255
    + e: reservado. 240.0.0.0 a 255.255.255.255
    + el primer octeto se da por el corrimiento del ultimo 1 de izquierda a derecha (0, 10, 110, 1110, 11110)
*** packet switching
    + el paquete se divide en el origen en unidades manejables: datagramas
    + los datagramas viajan al destino
    + se ensamblan en el destino para lograr el mensaje original
    + los paquetes se dividen segun los requisitos de cada punto intermedio (cada router)
*** ruteo
    + proceso de seleccion del camino de un paquete
    + entrega directa: transmision entre hosts de una misma red ip. no necesita del router. se encapsula el datagrama en una trama y se envia directamente
    + entrega indirecta: los hosts se encuentran en redes separadas. se envia el datagrama a un ruteador de su red ip encapsulandolo en una trama
    + se compara el netid del transmisor con el de destino. si son iguales es entrega directa
    + sino usan las tablas de ruteo que indican por cada posible ip el siguiente salto que debe tomar en la ruta hasta el destino
    + las tablas tambien se usan para entrega directa
