com/com.tex
\subsubsection{inundacion}
\label{sec:org33ea1d4}
\begin{itemize}
\item tecnica local. el enrutador envia por todas las lineas excepto por la que vino el paquete
\item gran cantidad de duplicados
\item numero maximo de saltos en la cabecera
\item numero de secuencia en paquetes para no enviarlos dos veces
\item no es practico para la mayoria de envios. pero tienen usos importantes como la difusion, porque asegura que todas las estaciones reciban el paquete
\item es en extremo robusta
\item requiere poca configuracion
\item siempre encuentra la ruta mas corta, sin contar el congestionamiento que provoca el algoritmo
\end{itemize}
\subsubsection{enrutamiento por vector de distancia}
\label{sec:org431e364}
\begin{itemize}
\item cada enrutador mantiene un vector (una tabla) con la mejor ruta para cada destino. esta tabla se va actualizando
\item cada T ms cada enrutador manda a sus vecinos su tabla
\item problema del conteo al infinito: la convergencia llega a la respuesta correcta, pero lo hace lentamente
\end{itemize}
\subsubsection{enrutamiento por estados de enlace}
\label{sec:orga628f52}
\begin{itemize}
\item las variantes is-is y ospf son usadas en la actualidad en internet
\item descrubrir a sus vecinos
\begin{itemize}
\item cuando un enrutador se pone en funcionamiento envia paquetes por todas las lineas que son respondidos con informacion de los vecinos
\end{itemize}
\end{itemize}
\subsubsection{enrutamiento jerarquico}
\label{sec:orgf07cf51}
\subsubsection{enrutamiento por difusion}
\label{sec:org8f53bb0}
\subsubsection{enrutamiento multidifusion}
\label{sec:org1d34b82}
\subsubsection{enrutamiento anycast}
\label{sec:org1b89216}
\subsubsection{enrutamiento para hosts moviles}
\label{sec:org1689516}
\subsubsection{enrutamiento para redes ad hoc}
\label{sec:org5c9f436}
\subsection{algoritmos de control de congestion}
\label{sec:org9979b36}
\begin{itemize}
\item las capas de red y transposte manejan la congestion
\item el control de congestion lo hace la red como conjunto. control de flujo se hace entre un emisor y receptor en particular
\end{itemize}
\subsubsection{metodos para control de congestion}
\label{sec:org91d889c}
\begin{itemize}
\item la presencia de congestion significa que la carga es mayor que los recursos
\item la manera mas basica es contruir una red que coincida con el trafico que transmita
\item aprovisionamiento: enrutadores y enlaces que se utilicen mucho son los que se actualizan primero
\item enrutamiento conciente de trafico: las rutas se pueden ajustar segun patrones de trafico
\item cuando no es posible aumentar la capacidad hay que reducir la carga, como rechazar nuevas conexiones (control de admision)
\item reconocer cuando empieza la congestion: para eso se monitorean la carga promedio, retardo de encolamiento y perdida de paquetes
\item como avisar a las fuentes: debe haber retroalimentacion. hay que ajustar la escala de tiempo con cuidado
\item si falla todo hay que empezar a descartar paquetes
\end{itemize}
\subsubsection{enrutamiento conciente de trafico}
\label{sec:org0ff6fe0}
\subsubsection{control de admision}
\label{sec:org633b939}
\begin{itemize}
\item usada en redes de circuitos virtuales
\item no agregar conexiones a menos que no lleve a congestion de la red
\item como saber cuando una conexion generara congestion?
\item describir tasa de transmision de una forma simple pero significativa es dificil
\item leaky bucket o token bucket: vincula la tasa promedio y el tamaño de la rafaga instantanea de trafico
\item se puede usar el comportamiento pasado para estimar el numero de circuitos que admite una red
\end{itemize}
\subsubsection{regulacion de trafico}
\label{sec:orgb0e3373}
\begin{itemize}
\item la red aspira a operar justo antes de que empiece la congestion
\item los enrutadores deben determinar cuando se acerca. se puede usar enlaces de salida, \textbf{bufer de paquetes en cola}, numero de paquetes que se pierden
\item tambien deben entregar una retroalimentacion a los que generan congestion
\item paquetes reguladores: se avisa al origen que su paquete provoca congestion, con un bit en el encabezado. el emisor puede esperar un poco y reenviar
\item notificacion explicita de congestion (ecn): el enrutador reenvia paquetes congestionados con el encabezado modificado. cualquiera que lo recibe sabe el estado de la red y actua
\item contrapresion de salto por salto: los paquetes reguladores surten efecto en todos los puntos intermedios
\end{itemize}
\subsubsection{desprendimiento de carga}
\label{sec:org4fd8b87}
\begin{itemize}
\item cual paquete tirar depende de la aplicacion
\item un desprendimiento mas inteligente requiere cooperacion de los emisores. por ejemplo paquetes que mandan informacion de enrutamiento
\item las aplicaciones pueden marcar que tan importante son los paquetes
\end{itemize}
\subsection{calidad de servicio}
\label{sec:org6fbc9a1}
\begin{itemize}
\item exceso de aprovisionamiento: contruir una red con la suficiente capacidad para el trafico que maneje. mas costoso. a veces no se puede predecir los cambios en la cantidad de trafico
\item cuatro aspectos para asegurar la calidad de servicio:
\begin{itemize}
\item lo que las aplicaciones necesitan de la red
\item como regular el trafico que entra en la red
\item como reservar recursos en los enrutadores para garantizar el desempeño
\item si la red puede aceptar mas trafico de forma segura
\end{itemize}
\end{itemize}
\subsubsection{requerimientos de la aplicacion}
\label{sec:org6c25f99}
\begin{itemize}
\item parametros que caracterizan las necesidades de cada flujo: ancho de banda, retardo, variacion de retardo, perdida
\end{itemize}
\subsubsection{modelado de trafico}
\label{sec:org4c168f9}
\begin{itemize}
\item 
\end{itemize}
\subsection{ipv4}
\label{sec:org08be54a}
\begin{itemize}
\item conmutacion de paquetes
\item servicio sin conexion
\end{itemize}
\subsubsection{objetivos}
\label{sec:org0f999fe}
\begin{itemize}
\item funcion de ruteo
\item transparencia en la red de redes
\item reglas de entrega de paquetes no confiable
\item unidad basica: datagrama
\end{itemize}
\subsubsection{formato}
\label{sec:org1268fb8}
\begin{itemize}
\item tamaño variable por posibilidad de incluir opciones
\item campo type of service para informar como debe ser tratado el paquete
\end{itemize}
\subsubsection{fragmentacion}
\label{sec:org90eb9f6}
\begin{itemize}
\item los datagramas pueden pasar por redes de mayor o menor mtu
\item cada router intermedio fragmenta los datos de acuerdo con el mtu de salida
\item los fragmentos son reensamblados una vez que llegan a destino
\item la fragmentacion se controla con campos en la cabecera
\end{itemize}
\subsubsection{otros campos}
\label{sec:org9cf0143}
\begin{itemize}
\item ttl (time to live): cuanto tiempo en segundos un paquete puede estar en la red. si llega a 0 se envia un mensaje icmp de error al origen
\item protocol: indica el protocolo de nivel superior que fue usado
\item options: no estan incluidos en todos los datagramas
\end{itemize}
\subsubsection{clases de direcciones}
\label{sec:org3312f7d}
\begin{itemize}
\item a: r.h.h.h. 1.0.0.0 a 126.0.0.0
\item b: r.r.h.h. 128.0.0.0 a 191.255.0.0
\item c: r.r.r.h. 192.0.0.0 a 223.255.255.0
\item d: multicast address. 224.0.0.0 a 239.255.255.255
\item e: reservado. 240.0.0.0 a 255.255.255.255
\item el primer octeto se da por el corrimiento del ultimo 1 de izquierda a derecha (0, 10, 110, 1110, 11110)
\end{itemize}
\subsubsection{packet switching}
\label{sec:org68c4b67}
\begin{itemize}
\item el paquete se divide en el origen en unidades manejables: datagramas
\item los datagramas viajan al destino
\item se ensamblan en el destino para lograr el mensaje original
\item los paquetes se dividen segun los requisitos de cada punto intermedio (cada router)
\end{itemize}
\subsubsection{ruteo}
\label{sec:org3478034}
\begin{itemize}
\item proceso de seleccion del camino de un paquete
\item entrega directa: transmision entre hosts de una misma red ip. no necesita del router. se encapsula el datagrama en una trama y se envia directamente
\item entrega indirecta: los hosts se encuentran en redes separadas. se envia el datagrama a un ruteador de su red ip encapsulandolo en una trama
\item se compara el netid del transmisor con el de destino. si son iguales es entrega directa
\item sino usan las tablas de ruteo que indican por cada posible ip el siguiente salto que debe tomar en la ruta hasta el destino
\item las tablas tambien se usan para entrega directa
\end{itemize}
