com/com.org
*** direcciones privadas
    + las ipv4 no alcanzan para todos los dispositivos del mundo
    + cada red interna usa un conjunto de ip privadas que se repiten en cada red que no sale a internet
    + por dentro la red se maneja con esas ip privadas, y desde afuera se ve una sola ip
*** subredes ip
    + cuando se usan bits de la parte de host para crear subredes
** icmp: internet control message protocol
   + ip falla cuando el destino se desconecta de la red, cuando pasa el timeout para la respuesta o cuando router intermediarios estan muy congestionados
   + icmp es requerido por ip y debe ser incluido en una implementacion del protocolo
   + reporta errores, no corrige. aunque sugiere accioner a tomar
*** funciones
    + error: un nodo que reconoce un error de transmision genera un paquete icmp. este se reporta a la fuente original, que es la que esta en la cabecera del paquete. no puede avisar a los routers intermedios. ni el origen saber que router tuvo el problema
    + control: herramientas de diagnostico de la red (ping, traceroute)
    + trama { ip { icmp {} } }
*** tipos
    + 8/0 ping: solicitud eco/respuesta
    + 3 destination unreachable: cuando no puede entregar/direccionar un datagrama
    + 4 source quench: congestionamiento
    + 5 route change request: usado por el router directamente conectado host fuente para cambio de ruta
    + 11 time exceeded
    + 13/14: timestamp para sincronizacion, calculo de viaje redondo, etc
    + 17/18: solicitud/respuesta de mascara
** arp: address resolution protocol
   + se usa para obtener direcciones mac, tanto para el ultimo paso (host destino) como para intermedios (routers)
   + el pedido es broadcast, la respuesta es unicast
   + el transmisor incluye su mac e ip para que los host actualicen
   + trama { arp {} }
   + dos partes: transforma direcciones ip en direcciones fisicas. responde pedidos de otras maquinas
   + se mantiene una tabla con direcciones guardadas, que se actualizan cada cierto tiempo
   + por que se usa un broadcast que alcanza al destino para despues enviar un mensaje al mismo destino?: los mensajes broadcast son mas costosos porque cada maquina debe procesar el mensaje
** ipv6
   + necesidad de mas direcciones porque las ipv4 no alcanzaban
   + cabecera base simple, tamaño fijo, menos campos
   + tamaño de direcciones de 128 bits
*** tipos de direcciones
    + unicast global
      + como las publicas de ipv4
      + ruteables en internet
      + prefijo 2000::/3
      + rango desde 2000::/3 hasta 3000::/3
    + unicast link local
      + alcance solo para enlace
      + no son ruteables
      + prefijo fe80::/64
    + unicast unique local
      + solo validas dentro de una organizacion. como las privadas de ipv4
      + no son ruteables en internet
      + prefijo fc00::/7
    + anycast
    + multicast
      + prefijo ff0[1|2|5|14]::/8, [nodo local,link local,site local,global]
      + identificador de grupo: [1|2], [todos los nodos,todos los routers]
*** protocolos ipv6
    + neighbor discovery (ND)
      + para encontrar otros nodos en la misma subred
      + se activa cuando la interfaz ipv6 se activa. no puede dejar de funcionar
    + router discovery (RD)
      + lo usan los routers para anunciarse en la subred
      + los routers no responden RD
    + duplicate address detection (DAD)
      + cuando se encuentra una direccion duplicada en una interfaz, se deshabilita hasta que se resuelve el problema
    + icmpv6
    + dhcpv6
* capa de transporte
  + las computadoras ejecutar muchos procesos a la vez, que serian los ultimos destinatarios de los mensajes enviados a traves de una red
  + en vez de eso cada proceso puede acceder a puntos abstractos de destino llamados puertos
  + los puertos se manejan de manera sincrona y con buffers
  + ahora los mensajes deben tener direccion ip de destino y puerto. tambien puerto de origen para las respuestas
*** user data protocol (udp)
    + cada datagrama udp posee direccion ip y puerto de origen y de destino
    + sin conexion, sin acuses de recibo, no se ordenan los mensajes y tampoco se usa retroalimentacion para control de flujo
    + todo lo que no tiene udp lo deberia dar la aplicacion
    + para el calculo del checksum se usa un pseudoheader, que incluye la direccion ip no presente en el datagrama udp
    + ip para diferenciar hosts, udp para diferenciar destinos dentro de un host
    + para generar el pseudoheader el origen debe conocer el ip destino, por lo que debe haber averiguado antes donde mandar. esta interaccion entre udp e ip viola la filosofia de separacion del modelo de capas
    + la multiplexacion y demultiplexacion se maneja con el sistema de puertos. las aplicaciones piden al sistema operativo un puerto
    + cuando udp recibe un datagrama, se fija que el puerto este en uso, sino lo descarta y manda un icmp
    + dos formas de asignar puertos: una autoridad central los elije y las aplicaciones usan segun esta eleccion /well-known ports/. otra forma es la dinamica, donde cada vez que una aplicacion necesita un puerto el software de red le asigna una, despues para conocer que puerto fue usado las otras computadoras consultan
