com/com.tex
\subsubsection{direcciones privadas}
\label{sec:orga10c89d}
\begin{itemize}
\item las ipv4 no alcanzan para todos los dispositivos del mundo
\item cada red interna usa un conjunto de ip privadas que se repiten en cada red que no sale a internet
\item por dentro la red se maneja con esas ip privadas, y desde afuera se ve una sola ip
\end{itemize}
\subsubsection{subredes ip}
\label{sec:org5173fd1}
\begin{itemize}
\item cuando se usan bits de la parte de host para crear subredes
\end{itemize}
\subsection{icmp: internet control message protocol}
\label{sec:org6e2358d}
\begin{itemize}
\item ip falla cuando el destino se desconecta de la red, cuando pasa el timeout para la respuesta o cuando router intermediarios estan muy congestionados
\item icmp es requerido por ip y debe ser incluido en una implementacion del protocolo
\item reporta errores, no corrige. aunque sugiere accioner a tomar
\end{itemize}
\subsubsection{funciones}
\label{sec:org941c596}
\begin{itemize}
\item error: un nodo que reconoce un error de transmision genera un paquete icmp. este se reporta a la fuente original, que es la que esta en la cabecera del paquete. no puede avisar a los routers intermedios. ni el origen saber que router tuvo el problema
\item control: herramientas de diagnostico de la red (ping, traceroute)
\item trama \{ ip \{ icmp \{\} \} \}
\end{itemize}
\subsubsection{tipos}
\label{sec:org206aa59}
\begin{itemize}
\item 8/0 ping: solicitud eco/respuesta
\item 3 destination unreachable: cuando no puede entregar/direccionar un datagrama
\item 4 source quench: congestionamiento
\item 5 route change request: usado por el router directamente conectado host fuente para cambio de ruta
\item 11 time exceeded
\item 13/14: timestamp para sincronizacion, calculo de viaje redondo, etc
\item 17/18: solicitud/respuesta de mascara
\end{itemize}
\subsection{arp: address resolution protocol}
\label{sec:orge14110c}
\begin{itemize}
\item se usa para obtener direcciones mac, tanto para el ultimo paso (host destino) como para intermedios (routers)
\item el pedido es broadcast, la respuesta es unicast
\item el transmisor incluye su mac e ip para que los host actualicen
\item trama \{ arp \{\} \}
\item dos partes: transforma direcciones ip en direcciones fisicas. responde pedidos de otras maquinas
\item se mantiene una tabla con direcciones guardadas, que se actualizan cada cierto tiempo
\item por que se usa un broadcast que alcanza al destino para despues enviar un mensaje al mismo destino?: los mensajes broadcast son mas costosos porque cada maquina debe procesar el mensaje
\end{itemize}
\subsection{ipv6}
\label{sec:org2d6bfce}
\begin{itemize}
\item necesidad de mas direcciones porque las ipv4 no alcanzaban
\item cabecera base simple, tamaño fijo, menos campos
\item tamaño de direcciones de 128 bits
\end{itemize}
\subsubsection{tipos de direcciones}
\label{sec:org46dbabb}
\begin{itemize}
\item unicast global
\begin{itemize}
\item como las publicas de ipv4
\item ruteables en internet
\item prefijo 2000::/3
\item rango desde 2000::/3 hasta 3000::/3
\end{itemize}
\item unicast link local
\begin{itemize}
\item alcance solo para enlace
\item no son ruteables
\item prefijo fe80::/64
\end{itemize}
\item unicast unique local
\begin{itemize}
\item solo validas dentro de una organizacion. como las privadas de ipv4
\item no son ruteables en internet
\item prefijo fc00::/7
\end{itemize}
\item anycast
\item multicast
\begin{itemize}
\item prefijo ff0[1|2|5|14]::/8, [nodo local,link local,site local,global]
\item identificador de grupo: [1|2], [todos los nodos,todos los routers]
\end{itemize}
\end{itemize}
\subsubsection{protocolos ipv6}
\label{sec:org867466f}
\begin{itemize}
\item neighbor discovery (ND)
\begin{itemize}
\item para encontrar otros nodos en la misma subred
\item se activa cuando la interfaz ipv6 se activa. no puede dejar de funcionar
\end{itemize}
\item router discovery (RD)
\begin{itemize}
\item lo usan los routers para anunciarse en la subred
\item los routers no responden RD
\end{itemize}
\item duplicate address detection (DAD)
\begin{itemize}
\item cuando se encuentra una direccion duplicada en una interfaz, se deshabilita hasta que se resuelve el problema
\end{itemize}
\item icmpv6
\item dhcpv6
\end{itemize}
\section{capa de transporte}
\label{sec:org904395f}
\begin{itemize}
\item las computadoras ejecutar muchos procesos a la vez, que serian los ultimos destinatarios de los mensajes enviados a traves de una red
\item en vez de eso cada proceso puede acceder a puntos abstractos de destino llamados puertos
\item los puertos se manejan de manera sincrona y con buffers
\item ahora los mensajes deben tener direccion ip de destino y puerto. tambien puerto de origen para las respuestas
\end{itemize}
\subsubsection{user data protocol (udp)}
\label{sec:orgba1cbae}
\begin{itemize}
\item cada datagrama udp posee direccion ip y puerto de origen y de destino
\item sin conexion, sin acuses de recibo, no se ordenan los mensajes y tampoco se usa retroalimentacion para control de flujo
\item todo lo que no tiene udp lo deberia dar la aplicacion
\item para el calculo del checksum se usa un pseudoheader, que incluye la direccion ip no presente en el datagrama udp
\item ip para diferenciar hosts, udp para diferenciar destinos dentro de un host
\item para generar el pseudoheader el origen debe conocer el ip destino, por lo que debe haber averiguado antes donde mandar. esta interaccion entre udp e ip viola la filosofia de separacion del modelo de capas
\item la multiplexacion y demultiplexacion se maneja con el sistema de puertos. las aplicaciones piden al sistema operativo un puerto
\item cuando udp recibe un datagrama, se fija que el puerto este en uso, sino lo descarta y manda un icmp
\item dos formas de asignar puertos: una autoridad central los elije y las aplicaciones usan segun esta eleccion \emph{well-known ports}. otra forma es la dinamica, donde cada vez que una aplicacion necesita un puerto el software de red le asigna una, despues para conocer que puerto fue usado las otras computadoras consultan
\end{itemize}
