com/com.org
*** reliable stream transport service (tcp)
    + el programador no tiene que preocuparse por la confiabilidad de la red si el protocolo lo hace
    + propiedades
      + los datos se piensan como un flujo de bytes. al receptor le llegan exactamente los mensajes enviados por el transmisor
      + conexion de circuito virtual. antes de la transferencia las dos aplicaciones se comunican para establecer los detalles de la conexion. durante la transferencia tambien hay intercambio de mensajes de exito o error
      + para hacer la transmision mas eficiente antes de enviar se acumulan datos hasta llenar un datagrama de cierto tamaño. tambien provee un servicio push
      + los datos enviados no tienen estructura
      + conexiones full duplex
    + reconocimiento positivo y retransmision. el receptor envia un ack cada vez que le llegan datos. el emisor lleva cuenta de los paquetes enviados y si no recibe respuesta reenvia
    + numero de secuencia a cada paquete para evitar duplicados. tambien son reenviados con el ack
    + ventana semoviente (deslizante)
      + problema: el emisor no hace nada mientras espera el ack
      + mantener una ventana de mensajes: se envian una cantidad de mensajes determinado por el tamaño de la ventana
      + estos mensajes al principio no estan reconicidos (no se recibio el ack)
      + cuando se recibe el ack para el primer paquete la ventana se mueve
      + el emisor tambien mantiene una ventana
    + tcp especifica el formato que los datos deben tener, los menajes de reconocimiento y el procedimiento que dos computadoras deben seguir para una comunicacion confiable
    + usa puertos igual que udp, aunque mas complejos porque un solo puerto no corresponde a un solo objeto
    + tcp usa la conexion como abstraccion y no los puertos. una conexion se identifica por un par de extremos
    + se definen los extremos como un par (host,puerto) por lo que varios host pueden compartir el mismo puerto
    + antes de iniciar la comunicacion, un host debe indicar al sistema operativo que esta abierto a aceptar conexiones (/passive open/). se le asigna un numero de puerto, generando uno de los extremos
    + un host que se quiere comunicar debe requerirlo tambien mediante el sistema operativo
    + los dos modulos tcp se intercambian datos para establecer y verificar la conexion
    + tcp divide los datos en segmentos, que usualmente se transmite en un solo datagrama ip
    + la ventana semoviente tambien sirve para el control de flujo, permitiendo al receptor esperar hasta que tenga espacio
    + la ventana opera a nivel de octeto, no de segmento
    + tcp permite variacion en el tamaño de la ventana en el tiempo. cada ack lleva tambien el tamaño del buffer, por lo que se puede ir acomodando el tamaño de la ventana
    + los datos pueden ser marcados como urgentes, en caso de que se necesite que el receptor los procese apenas los reciba, por ejemplo interrupciones
    + el checksum se calcula como en udp sobre un pseudoheader
    + los ack especifican el numero de secuencia del octeto que se espera recibir (esquema acumulativo)
    + retransmision y timeout
      + cuando se envia un paquete, se prende un temporizador hasta recibir respuesta. si termina el tiempo se retransmite
      + tcp monitorea cada conexion para deducir los temporizadores, ya que pueden variar bastante. tcp esta hecho para comunicacion en internet
      + se registra el tiempo que tarda desde que se envia un paquete hasta que se rebice el ack (tiempo en redondo). y se va ajustando segun una formula con el viejo rtt y el nuevo
    + para evadir congestion, tcp usa dos tecnicas
      + multiplicative decrease: el tamaño de la ventana es el minimo del enviado en el ack y un tamaño de ventana de congestion. los dos inician iguales. cuando se pierde un segmento se reduce la ventana de congestion a la mitad
      + slow-start: cuando la congestion se alivia. por cada ack se aumenta el tamaño de segmento en 1. lo que no quiere decir que sea lento porque se por cada ack que se devuelve por cada segmento
* capa de aplicacion
** dns
   + traducir de nombre a direccion ip
   + tambien puede hace al reves
   + el recurso se convierte en critico. hay que tener mas de un servidor por si falla. servidores primarios, secundarios, etc
   + necesidad de delegar la administracion de los registros por el aumento de la cantidad
*** conceptos e implementacion
    + dominios y delegacion
      + estructura de arbol. la raiz, /top level domains/ (TLD), los nombres de dominio y puede seguir
      + TLD puede ser gTLD (generic): .com .edu .net o ccTLD (country code): .ar .us .es
    + autoridad y delegacion
      + la autoridad de la raiz la tiene la ICANN
      + gTLD los administra la ICANN y son delegados a registradores acreditados
      + ccTLD son delegados a los paises
      + cada nivel inferior puede delegar tambien
      + lo que esta mas a la izquierda es el host. www por convencion
      + el dueño puede delegar de la manera que quiera todo lo que esta a la izquierda de su dominio
    + componentes
      + un dns tiene tres partes: datos que describen el dominio, uno o mas progamas Name Server, un resolver
      + los datos se definen en RR (resource recods), organizados en archivos de texto llamados archivos de zona
      + el programa NS responde los pedidos de hosts locales o remotos
      + el resolver esta en cada host y traduce cada peticion del usuario en una o mas peticiones al servidor por tcp o udp
    + zonas y archivos de zonas
      + describen el dominio y sub-dominios
      + datos que describen propiedades generales del tope de la zona (soa record)
      + datos autoritativos para todos los nodos o host de la zona (a, aaaa)
      + informacion global para la zona (registros de mail mx, servidores de nombres NS)
      + en caso de delegacion a sub-dominio el nombre del servidor responsable (NS)
      + registros glue para cada sub-dominio
    + consultas
      + recursivas: se recibe una respuesta completa. no son obligatorias
      + iterativas: se puede recibir una respuesta o una referencia de quien preguntar. son obligatorias
      + inversas: obsoletas
    + consultas recursivas
      + da una respuesta o un error
      + se negocia con un bit en el header de la consulta
      + el resolver en representacion del cliente busca a traves del dns la respuesta
    + consultas iterativas
      + en vez de encargarse el resolver de buscar la respuesta si no la tiene, le devuelve al cliente una referencia de a quien puede preguntar
      + son mas rapidas, dan mas control al cliente, son mejores para sacar diagnosticos
    + actualizaciones de zonas: zone transfer (axfr) o incremental zone transfer (ixfr)
    + axfr
      + los esclavos toman la informacion del maestro, el intervalo es determinado en el registro soa
      + se pide el registro soa, si el numero de serial es mayor al que tiene se inicia la transferencia
      + udp puerto 53
    + ixfr
      + permite la actualizacion de registros en vez de la zona entera
      + el proceso es igual a axfr
      + tcp puerto 53
    + notify: el maestro tambien puede notificar a los esclavos antes del tiempo de actualizacion
    + actualizaciones dinamicas
      + la forma clasica de actualizar es manualmente cambiar los registros y reiniciar el servicio para que propague los cambios
      + cuando el sistema es grande puede traer problemas
      + dos soluciones: permitir actualizaciones de una aplicacion externa o tomar los datos de una base de datos que se pueda modificar dinamicamente
