com/com.tex
\subsubsection{reliable stream transport service (tcp)}
\label{sec:org312d0ec}
\begin{itemize}
\item el programador no tiene que preocuparse por la confiabilidad de la red si el protocolo lo hace
\item propiedades
\begin{itemize}
\item los datos se piensan como un flujo de bytes. al receptor le llegan exactamente los mensajes enviados por el transmisor
\item conexion de circuito virtual. antes de la transferencia las dos aplicaciones se comunican para establecer los detalles de la conexion. durante la transferencia tambien hay intercambio de mensajes de exito o error
\item para hacer la transmision mas eficiente antes de enviar se acumulan datos hasta llenar un datagrama de cierto tamaño. tambien provee un servicio push
\item los datos enviados no tienen estructura
\item conexiones full duplex
\end{itemize}
\item reconocimiento positivo y retransmision. el receptor envia un ack cada vez que le llegan datos. el emisor lleva cuenta de los paquetes enviados y si no recibe respuesta reenvia
\item numero de secuencia a cada paquete para evitar duplicados. tambien son reenviados con el ack
\item ventana semoviente (deslizante)
\begin{itemize}
\item problema: el emisor no hace nada mientras espera el ack
\item mantener una ventana de mensajes: se envian una cantidad de mensajes determinado por el tamaño de la ventana
\item estos mensajes al principio no estan reconicidos (no se recibio el ack)
\item cuando se recibe el ack para el primer paquete la ventana se mueve
\item el emisor tambien mantiene una ventana
\end{itemize}
\item tcp especifica el formato que los datos deben tener, los menajes de reconocimiento y el procedimiento que dos computadoras deben seguir para una comunicacion confiable
\item usa puertos igual que udp, aunque mas complejos porque un solo puerto no corresponde a un solo objeto
\item tcp usa la conexion como abstraccion y no los puertos. una conexion se identifica por un par de extremos
\item se definen los extremos como un par (host,puerto) por lo que varios host pueden compartir el mismo puerto
\item antes de iniciar la comunicacion, un host debe indicar al sistema operativo que esta abierto a aceptar conexiones (\emph{passive open}). se le asigna un numero de puerto, generando uno de los extremos
\item un host que se quiere comunicar debe requerirlo tambien mediante el sistema operativo
\item los dos modulos tcp se intercambian datos para establecer y verificar la conexion
\item tcp divide los datos en segmentos, que usualmente se transmite en un solo datagrama ip
\item la ventana semoviente tambien sirve para el control de flujo, permitiendo al receptor esperar hasta que tenga espacio
\item la ventana opera a nivel de octeto, no de segmento
\item tcp permite variacion en el tamaño de la ventana en el tiempo. cada ack lleva tambien el tamaño del buffer, por lo que se puede ir acomodando el tamaño de la ventana
\item los datos pueden ser marcados como urgentes, en caso de que se necesite que el receptor los procese apenas los reciba, por ejemplo interrupciones
\item el checksum se calcula como en udp sobre un pseudoheader
\item los ack especifican el numero de secuencia del octeto que se espera recibir (esquema acumulativo)
\item retransmision y timeout
\begin{itemize}
\item cuando se envia un paquete, se prende un temporizador hasta recibir respuesta. si termina el tiempo se retransmite
\item tcp monitorea cada conexion para deducir los temporizadores, ya que pueden variar bastante. tcp esta hecho para comunicacion en internet
\item se registra el tiempo que tarda desde que se envia un paquete hasta que se rebice el ack (tiempo en redondo). y se va ajustando segun una formula con el viejo rtt y el nuevo
\end{itemize}
\item para evadir congestion, tcp usa dos tecnicas
\begin{itemize}
\item multiplicative decrease: el tamaño de la ventana es el minimo del enviado en el ack y un tamaño de ventana de congestion. los dos inician iguales. cuando se pierde un segmento se reduce la ventana de congestion a la mitad
\item slow-start: cuando la congestion se alivia. por cada ack se aumenta el tamaño de segmento en 1. lo que no quiere decir que sea lento porque se por cada ack que se devuelve por cada segmento
\end{itemize}
\end{itemize}
\section{capa de aplicacion}
\label{sec:org46142a1}
\subsection{dns}
\label{sec:org9dee915}
\begin{itemize}
\item traducir de nombre a direccion ip
\item tambien puede hace al reves
\item el recurso se convierte en critico. hay que tener mas de un servidor por si falla. servidores primarios, secundarios, etc
\item necesidad de delegar la administracion de los registros por el aumento de la cantidad
\end{itemize}
\subsubsection{conceptos e implementacion}
\label{sec:org16cc1e4}
\begin{itemize}
\item dominios y delegacion
\begin{itemize}
\item estructura de arbol. la raiz, \emph{top level domains} (TLD), los nombres de dominio y puede seguir
\item TLD puede ser gTLD (generic): .com .edu .net o ccTLD (country code): .ar .us .es
\end{itemize}
\item autoridad y delegacion
\begin{itemize}
\item la autoridad de la raiz la tiene la ICANN
\item gTLD los administra la ICANN y son delegados a registradores acreditados
\item ccTLD son delegados a los paises
\item cada nivel inferior puede delegar tambien
\item lo que esta mas a la izquierda es el host. www por convencion
\item el dueño puede delegar de la manera que quiera todo lo que esta a la izquierda de su dominio
\end{itemize}
\item componentes
\begin{itemize}
\item un dns tiene tres partes: datos que describen el dominio, uno o mas progamas Name Server, un resolver
\item los datos se definen en RR (resource recods), organizados en archivos de texto llamados archivos de zona
\item el programa NS responde los pedidos de hosts locales o remotos
\item el resolver esta en cada host y traduce cada peticion del usuario en una o mas peticiones al servidor por tcp o udp
\end{itemize}
\item zonas y archivos de zonas
\begin{itemize}
\item describen el dominio y sub-dominios
\item datos que describen propiedades generales del tope de la zona (soa record)
\item datos autoritativos para todos los nodos o host de la zona (a, aaaa)
\item informacion global para la zona (registros de mail mx, servidores de nombres NS)
\item en caso de delegacion a sub-dominio el nombre del servidor responsable (NS)
\item registros glue para cada sub-dominio
\end{itemize}
\item consultas
\begin{itemize}
\item recursivas: se recibe una respuesta completa. no son obligatorias
\item iterativas: se puede recibir una respuesta o una referencia de quien preguntar. son obligatorias
\item inversas: obsoletas
\end{itemize}
\item consultas recursivas
\begin{itemize}
\item da una respuesta o un error
\item se negocia con un bit en el header de la consulta
\item el resolver en representacion del cliente busca a traves del dns la respuesta
\end{itemize}
\item consultas iterativas
\begin{itemize}
\item en vez de encargarse el resolver de buscar la respuesta si no la tiene, le devuelve al cliente una referencia de a quien puede preguntar
\item son mas rapidas, dan mas control al cliente, son mejores para sacar diagnosticos
\end{itemize}
\item actualizaciones de zonas: zone transfer (axfr) o incremental zone transfer (ixfr)
\item axfr
\begin{itemize}
\item los esclavos toman la informacion del maestro, el intervalo es determinado en el registro soa
\item se pide el registro soa, si el numero de serial es mayor al que tiene se inicia la transferencia
\item udp puerto 53
\end{itemize}
\item ixfr
\begin{itemize}
\item permite la actualizacion de registros en vez de la zona entera
\item el proceso es igual a axfr
\item tcp puerto 53
\end{itemize}
\item notify: el maestro tambien puede notificar a los esclavos antes del tiempo de actualizacion
\item actualizaciones dinamicas
\begin{itemize}
\item la forma clasica de actualizar es manualmente cambiar los registros y reiniciar el servicio para que propague los cambios
\item cuando el sistema es grande puede traer problemas
\item dos soluciones: permitir actualizaciones de una aplicacion externa o tomar los datos de una base de datos que se pueda modificar dinamicamente
\end{itemize}
\end{itemize}
