com/com.org
*** mapeo inverso
    + usado por sistemas de mail
    + diseñadores de dns usan el nombre de dominio especial in-addr.arpa o ip6.arpa
    + las direcciones ip son divididas en bloques para varias regiones del mundo. cada una puede subdividirse, delegando la autoridad para el mapeo
    + para los archivos de zona se invierte la direccion y se agrega in-addr.arpa. despues se listan lost hosts y los nombres completos terminados en punto
    + TODO
*** tipos de dns
    + maestro (primario)
      + define uno o mas archivos de zona donde es autoritativo. la zona fue delegada con un registro NS
      + un maestro de zona toma los datos de una fuente local, un esclavo de una fuente externa (usualmente un maestro)
      + el maestro puede notificar a los esclavos sobre cambios en el archivo de zona
      + puede estar oculto, alguno de los esclavos puede no saber de su existencia
    + esclavo (secundario)
      + toma sus datos por transferencia
      + responde como autoritativo de la zona que le corresponde
      + no es posible saber si el resultado de una consulta vino de un maestro o esclavo
      + puede haber cualquier cantidad de esclavos en una zona
    + un esclavo tambien puede ser maestro
      + puede ser usado si un maestro esta oculto, por cuestiones de seguridad para aislar un servidor (tomalo con pinza)
    + resolver o servidores cache
      + obtiene los datos de otro servidor y guarda la respuesta para consultas posteriores
      + si devuelve un dato que trajo del maestro responde como autoritativo, si es de cache como no-autoritativo
      + dos configuraciones habituales: un servidor maestro o esclavo para alguna zona y como resolver para las demas consultas. un servidor solo como resolver (proxy/forwarding server)
    + servidores forwarding
      + simplemente pasan consultas a otros servidores y guardan las respuestas en cache
      + util por si el servidor remoto es lento
      + puede ser parte de un servidor dividido para seguridad
    + servidor oculto (/stealth/)
      + no aparece definido publicamente en ningun registro NS del dominio
      + por ejemplo una organizacion necesita un dns publico para acceder a servicios de mail, ftp, y no quiere que el exterior vea sus hosts internos
      + el servidor publico muestra solo los servicios publicos y no acepta transferencias del oculto
    + servidor solo autoritativo
      + el termino se usa para describir un servidor que responde como autoritativo y no hace cache
      + configuraciones usuales: servidor externo de un oculto, servidores de alto rendimiento
    + split horizon
      + devuelven distintas respuestas segun la direccion de origen, o alguna otra caracteristica
      + segun posicion geografica: para devolver direcciones que esten mas cerca
      + si ciertas direcciones tienen mas privilegios se les puede devolver una respuesta especial que al resto, pero las consultas siempre son con el mismo nombre de dominio
      + equilibrio de carga
