com/com.tex
\subsubsection{mapeo inverso}
\label{sec:orgf17b6bd}
\begin{itemize}
\item usado por sistemas de mail
\item diseñadores de dns usan el nombre de dominio especial in-addr.arpa o ip6.arpa
\item las direcciones ip son divididas en bloques para varias regiones del mundo. cada una puede subdividirse, delegando la autoridad para el mapeo
\item para los archivos de zona se invierte la direccion y se agrega in-addr.arpa. despues se listan lost hosts y los nombres completos terminados en punto
\item TODO
\end{itemize}
\subsubsection{tipos de dns}
\label{sec:orge2a53d2}
\begin{itemize}
\item maestro (primario)
\begin{itemize}
\item define uno o mas archivos de zona donde es autoritativo. la zona fue delegada con un registro NS
\item un maestro de zona toma los datos de una fuente local, un esclavo de una fuente externa (usualmente un maestro)
\item el maestro puede notificar a los esclavos sobre cambios en el archivo de zona
\item puede estar oculto, alguno de los esclavos puede no saber de su existencia
\end{itemize}
\item esclavo (secundario)
\begin{itemize}
\item toma sus datos por transferencia
\item responde como autoritativo de la zona que le corresponde
\item no es posible saber si el resultado de una consulta vino de un maestro o esclavo
\item puede haber cualquier cantidad de esclavos en una zona
\end{itemize}
\item un esclavo tambien puede ser maestro
\begin{itemize}
\item puede ser usado si un maestro esta oculto, por cuestiones de seguridad para aislar un servidor (tomalo con pinza)
\end{itemize}
\item resolver o servidores cache
\begin{itemize}
\item obtiene los datos de otro servidor y guarda la respuesta para consultas posteriores
\item si devuelve un dato que trajo del maestro responde como autoritativo, si es de cache como no-autoritativo
\item dos configuraciones habituales: un servidor maestro o esclavo para alguna zona y como resolver para las demas consultas. un servidor solo como resolver (proxy/forwarding server)
\end{itemize}
\item servidores forwarding
\begin{itemize}
\item simplemente pasan consultas a otros servidores y guardan las respuestas en cache
\item util por si el servidor remoto es lento
\item puede ser parte de un servidor dividido para seguridad
\end{itemize}
\item servidor oculto (\emph{stealth})
\begin{itemize}
\item no aparece definido publicamente en ningun registro NS del dominio
\item por ejemplo una organizacion necesita un dns publico para acceder a servicios de mail, ftp, y no quiere que el exterior vea sus hosts internos
\item el servidor publico muestra solo los servicios publicos y no acepta transferencias del oculto
\end{itemize}
\item servidor solo autoritativo
\begin{itemize}
\item el termino se usa para describir un servidor que responde como autoritativo y no hace cache
\item configuraciones usuales: servidor externo de un oculto, servidores de alto rendimiento
\end{itemize}
\item split horizon
\begin{itemize}
\item devuelven distintas respuestas segun la direccion de origen, o alguna otra caracteristica
\item segun posicion geografica: para devolver direcciones que esten mas cerca
\item si ciertas direcciones tienen mas privilegios se les puede devolver una respuesta especial que al resto, pero las consultas siempre son con el mismo nombre de dominio
\item equilibrio de carga
\end{itemize}
\end{itemize}
\end{document}